; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v12)
             (pred_10 ?v1 ?v4)
             (pred_4 ?v11 ?v4)
             (pred_9 ?v8 ?v11 )
	     (pred_8 ?v11)
             (pred_7 ?v13)
             (pred_3 ?v1)
             (pred_5 ?v4)
             (pred_1 ?v11)
             (pred_11 ?v1)
             (pred_2 ?v11)
             (pred_12 ))



(:action op_5
:parameters (?v3 ?v7 ?v6 ?v9)
:precondition (and (pred_7 ?v3) (pred_7 ?v7) (pred_3 ?v6) (pred_5 ?v9)
          (pred_6 ?v3 ?v7) (pred_10 ?v6 ?v9)
                   (pred_4 ?v7 ?v9) (pred_8 ?v3) 
                   (pred_1 ?v7) (pred_11 ?v6))
:effect (and  (pred_2 ?v7) (not (pred_1 ?v7))))


(:action op_1
:parameters (?v3 ?v2)
:precondition (and (pred_7 ?v3) (pred_7 ?v2)
               (pred_8 ?v3) (pred_6 ?v3 ?v2) (pred_2 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v3))))

(:action op_4
:parameters (?v3 ?v6)
:precondition (and (pred_7 ?v3) (pred_3 ?v6) 
                  (pred_8 ?v3) (pred_9 ?v6 ?v3) (pred_12 ))
:effect (and (pred_11 ?v6)
   (not (pred_9 ?v6 ?v3)) (not (pred_12 ))))


(:action op_3
:parameters (?v3 ?v5 ?v10)
:precondition (and (pred_7 ?v3) (pred_3 ?v5) (pred_3 ?v10)
                  (pred_8 ?v3) (pred_11 ?v10) (pred_9 ?v5 ?v3))
:effect (and (pred_11 ?v5) (pred_9 ?v10 ?v3)
        (not (pred_11 ?v10)) (not (pred_9 ?v5 ?v3))))

(:action op_2
:parameters (?v3 ?v6)
:precondition (and (pred_7 ?v3) (pred_3 ?v6) 
                  (pred_8 ?v3) (pred_11 ?v6))
:effect (and (pred_12 ) (pred_9 ?v6 ?v3) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_06 obj_17 obj_09 obj_20 obj_16 obj_11 obj_19 obj_03 obj_04 obj_01 obj_14 obj_08 obj_15 obj_10 obj_05
    obj_12 obj_13
    obj_07 obj_18
    )

    (:init
       (pred_12)

       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_18)

       (pred_6 obj_02 obj_20)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_4  obj_01 obj_12)
       (pred_4  obj_08 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_06)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_19)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_10)
       (pred_2 obj_05)

       (pred_10  obj_07 obj_12)
       (pred_10  obj_18 obj_13)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_18 obj_20)
       (pred_8 obj_15)
    )

    (:goal (and
       (pred_9 obj_07 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_1 obj_15 obj_04)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_1 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 0 of 1
3. (op_1 obj_03 obj_20)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_20)
   goals met: 0 of 1
4. (op_1 obj_20 obj_02)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_02)
   goals met: 0 of 1
5. (op_1 obj_02 obj_06)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_06)
   goals met: 0 of 1
6. (op_1 obj_06 obj_17)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_11)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_07)
   deleted: (pred_9 obj_07 obj_11) (pred_12)
   added: (pred_11 obj_07)
   goals met: 0 of 1
9. (op_5 obj_11 obj_01 obj_07 obj_12)
   deleted: (pred_1 obj_01)
   added: (pred_2 obj_01)
   goals met: 0 of 1
10. (op_1 obj_11 obj_01)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_01)
   goals met: 0 of 1
11. (op_1 obj_01 obj_04)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_04)
   goals met: 0 of 1
12. (op_2 obj_04 obj_07)
   deleted: (pred_11 obj_07)
   added: (pred_12) (pred_9 obj_07 obj_04)
   goals met: 1 of 1
